In [1]:
# package
import pandas as pd

In [2]:
# import data
data1 = pd.read_csv('data/data-pemilih-kpu.csv',index_col=False)
data2 = pd.read_csv('data/indonesian-names.csv',index_col=False)

In [3]:
data1

                             nama jenis_kelamin
0                  ERWIN TJAHJONO     Laki-Laki
1      DAVIANDRIE ANDIKA BAHROENY     Laki-Laki
2                  ELAN KURNIAWAN     Laki-Laki
3         AYU DWI CAHYANING MUKTI     Perempuan
4                       WAHYOEDIN     Laki-Laki
...                           ...           ...
13132                  HERMANSYAH     Laki-Laki
13133                     SITA.HJ     Perempuan
13134              MASNI TAMBUNAN     Perempuan
13135                   MARJANEDI     Laki-Laki
13136                    NGALIMAN     Laki-Laki

[13137 rows x 2 columns]

In [4]:
data2

                             name gender
0                 hafizhan shidqi      m
1                   gandhi wibowo      m
2     aldio mahendra purwandrarto      m
3                     benny putra      m
4            vicky vernando dasta      m
...                           ...    ...
1955                      hadimah      f
1956          aprillia rahma wati      f
1957        muhamad khoirunisa. m      m
1958                      sukandi      m
1959                          eem      f

[1960 rows x 2 columns]

In [5]:
# change colum name
for i,T in zip(range(2),[data1,data2]):
    T.columns = ['Nama', 'Jenis Kelamin']

In [6]:
data1.columns
data2.columns

Index(['Nama', 'Jenis Kelamin'], dtype='object')

In [7]:
data = pd.concat([data1, data2], ignore_index=True)
data

                             Nama Jenis Kelamin
0                  ERWIN TJAHJONO     Laki-Laki
1      DAVIANDRIE ANDIKA BAHROENY     Laki-Laki
2                  ELAN KURNIAWAN     Laki-Laki
3         AYU DWI CAHYANING MUKTI     Perempuan
4                       WAHYOEDIN     Laki-Laki
...                           ...           ...
15092                     hadimah             f
15093         aprillia rahma wati             f
15094       muhamad khoirunisa. m             m
15095                     sukandi             m
15096                         eem             f

[15097 rows x 2 columns]

### Data Preparation

In [8]:
# volume
data.shape

(15097, 2)

In [9]:
# missing values
data.isna().any().sum()

2

In [10]:
# duplicated data
data.duplicated().any()

True

In [11]:
# drop missing values and duplicates data
data.dropna(axis=0, inplace=True)
data.drop_duplicates(keep='first', inplace=True)

print(f'Missing values: {data.isna().any().sum()}')
print(f'Duplicated data: {data.duplicated().any()}')

Missing values: 0
Duplicated data: False

In [12]:
# check data
data

                             Nama Jenis Kelamin
0                  ERWIN TJAHJONO     Laki-Laki
1      DAVIANDRIE ANDIKA BAHROENY     Laki-Laki
2                  ELAN KURNIAWAN     Laki-Laki
3         AYU DWI CAHYANING MUKTI     Perempuan
4                       WAHYOEDIN     Laki-Laki
...                           ...           ...
15092                     hadimah             f
15093         aprillia rahma wati             f
15094       muhamad khoirunisa. m             m
15095                     sukandi             m
15096                         eem             f

[13620 rows x 2 columns]

#### Name

In [13]:
# Title Case
data['Nama'] = data['Nama'].str.title()
data.head()

                         Nama Jenis Kelamin
0              Erwin Tjahjono     Laki-Laki
1  Daviandrie Andika Bahroeny     Laki-Laki
2              Elan Kurniawan     Laki-Laki
3     Ayu Dwi Cahyaning Mukti     Perempuan
4                   Wahyoedin     Laki-Laki

#### Jenis Kelamin

In [14]:
# check unique values
data['Jenis Kelamin'].unique()

array(['Laki-Laki', 'Perempuan', 'm', 'f'], dtype=object)

In [15]:
# fix colum 'Jenis Kelamin'
data['Jenis Kelamin'] = data['Jenis Kelamin'].replace({'m' : 'Laki-Laki',
                                'f' : 'Perempuan'})
data.head()

                         Nama Jenis Kelamin
0              Erwin Tjahjono     Laki-Laki
1  Daviandrie Andika Bahroeny     Laki-Laki
2              Elan Kurniawan     Laki-Laki
3     Ayu Dwi Cahyaning Mukti     Perempuan
4                   Wahyoedin     Laki-Laki

### Save Data

In [16]:
data.to_csv('data/nama_gender.csv', index=False)